-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2020-04-23 14:52:49
-- 伺服器版本： 10.4.11-MariaDB
-- PHP 版本： 7.4.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `my_db`
--

-- --------------------------------------------------------

--
-- 資料表結構 `admin`
--

CREATE TABLE `admin` (
  `id` int(11) NOT NULL COMMENT '流水號',
  `username` varchar(50) NOT NULL COMMENT '帳號名稱',
  `pwd` char(40) NOT NULL COMMENT '帳號密碼',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '建立時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `admin`
--

INSERT INTO `admin` (`id`, `username`, `pwd`, `created_at`, `updated_at`) VALUES
(1, 'test', 'a94a8fe5ccb19ba61c4c0873d391e987982fbbd3', '2020-04-23 09:38:41', '2020-04-23 09:40:01');

-- --------------------------------------------------------

--
-- 資料表結構 `company`
--

CREATE TABLE `company` (
  `companyId` varchar(5) NOT NULL COMMENT '廠商編號',
  `companyName` varchar(20) NOT NULL COMMENT '廠商名稱',
  `companyPhone` int(15) NOT NULL COMMENT '廠商電話',
  `principal` varchar(20) NOT NULL COMMENT '負責人',
  `principalPhone` int(15) NOT NULL COMMENT '負責人手機',
  `email` varchar(40) NOT NULL COMMENT '信箱',
  `companyAddress` varchar(50) NOT NULL COMMENT '地址',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '建立時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `company`
--

INSERT INTO `company` (`companyId`, `companyName`, `companyPhone`, `principal`, `principalPhone`, `email`, `companyAddress`, `created_at`, `updated_at`) VALUES
('F002', '夏淑貞', 298338368, '夏淑貞', 930016501, 'test02@gmail.com', '桃園市平鎮區太平西路19巷15號', '2020-04-23 16:20:00', '2020-04-22 20:40:17'),
('F003', '陸奕怡', 298338369, '陸奕怡', 930016502, 'test03@gmail.com', '屏東縣長治鄉德和路77號', '2020-04-24 16:20:00', '2020-04-24 16:20:00'),
('F005', '李淑敏', 298338371, '李淑敏', 930016504, 'test05@gmail.com', '桃園市平鎮區太平西路99巷18號', '2020-04-26 16:20:00', '2020-04-26 16:20:00'),
('F006', '蔡軒諭', 298338372, '蔡軒諭', 930016505, 'test06@gmail.com', '屏東縣長治鄉德和路75號', '2020-04-27 16:20:00', '2020-04-27 16:20:00'),
('F007', '林裕寧', 298338373, '林裕寧', 930016506, 'test07@gmail.com', '桃園市平鎮區太平西路99巷19號', '2020-04-28 16:20:00', '2020-04-28 16:20:00'),
('F008', '江佳妃', 298338374, '江佳妃', 930016507, 'test08@gmail.com', '屏東縣長治鄉德和路872號', '2020-04-29 16:20:00', '2020-04-22 20:40:02'),
('F009', '張博胤', 298338375, '張博胤', 930016508, 'test09@gmail.com', '嘉義縣太保市高鐵西路173號', '2020-04-30 16:20:00', '2020-04-30 16:20:00'),
('F010', '張佑霖', 298338376, '張佑霖', 930016509, 'test10@gmail.com', '屏東縣長治鄉德和路80號', '2020-05-01 16:20:00', '2020-05-01 16:20:00'),
('F012', '彭俊憲', 298338378, '彭俊憲', 930016511, 'test12@gmail.com', '桃園市平鎮區太平西路99巷13號', '2020-05-03 16:20:00', '2020-05-03 16:20:00'),
('F013', '郎士哲', 298338379, '郎士哲', 930016512, 'test13@gmail.com', '台北市大安區信義路四段149-2號', '2020-05-04 16:20:00', '2020-05-04 16:20:00'),
('F014', '黃玄豐', 298338380, '黃玄豐', 930016513, 'test14@gmail.com', '台北市大安區信義路四段149-12號', '2020-05-05 16:20:00', '2020-05-05 16:20:00'),
('F015', '余柔喬', 298338359, '余柔喬', 911163278, 'test15@gmail.com', '彰化縣彰化市崙平南路126號', '2020-04-22 20:51:08', '2020-04-22 20:51:08'),
('F016', '黃雅昌', 298338382, '黃雅昌', 930016515, 'test16@gmail.com', '台北市大安區信義路四段149-5號', '2020-05-07 16:20:00', '2020-05-07 16:20:00'),
('F017', '陳素玫', 298338383, '陳素玫', 930016516, 'test17@gmail.com', '台北市大安區信義路四段149-11號', '2020-05-08 16:20:00', '2020-05-08 16:20:00'),
('F020', '林彥山', 298338386, '林彥山', 930016519, 'test20@gmail.com', '彰化縣彰化市崙平南路132號', '2020-05-11 16:20:00', '2020-05-11 16:20:00'),
('F021', '林百治', 298338387, '林百治', 930016520, 'test21@gmail.com', '台北市大安區信義路四段149-6號', '2020-05-12 16:20:00', '2020-05-12 16:20:00'),
('F022', '宗恭威', 298338388, '宗恭威', 930016521, 'test22@gmail.com', '嘉義縣太保市高鐵西路168號', '2020-05-13 16:20:00', '2020-05-13 16:20:00'),
('F023', '陳玉白', 298338389, '陳玉白', 930016522, 'test23@gmail.com', '屏東縣長治鄉德和路76號', '2020-05-14 16:20:00', '2020-05-14 16:20:00'),
('F024', '邱秀玲', 298338390, '邱秀玲', 930016523, 'test24@gmail.com', '彰化縣彰化市崙平南路130號', '2020-05-15 16:20:00', '2020-05-15 16:20:00'),
('F025', '陸欣蓁', 298338391, '陸欣蓁', 930016524, 'test25@gmail.com', '彰化縣彰化市崙平南路129號', '2020-05-16 16:20:00', '2020-05-16 16:20:00'),
('F026', '本榮祿有限公司', 298338392, '許雅雄', 930016525, 'test26@gmail.com', '嘉義縣太保市高鐵西路170號', '2020-05-17 16:20:00', '2020-05-17 16:20:00'),
('F027', '聚全優有限公司', 298338393, '曾依勳', 930016526, 'test27@gmail.com', '屏東縣長治鄉德和路81號', '2020-05-18 16:20:00', '2020-05-18 16:20:00'),
('F028', '謙盛榮有限公司', 298338394, '鄭雅民', 930016527, 'test28@gmail.com', '台北市大安區信義路四段149-13號', '2020-05-19 16:20:00', '2020-05-19 16:20:00'),
('F029', '富吉晶有限公司', 298338395, '鄭怡伶', 930016528, 'test29@gmail.com', '彰化縣彰化市崙平南路128號', '2020-05-20 16:20:00', '2020-05-20 16:20:00'),
('F030', '千廣優有限公司', 298338396, '李易江', 930016529, 'test30@gmail.com', '台北市大安區信義路四段149-7號', '2020-05-21 16:20:00', '2020-05-21 16:20:00'),
('F031', '國瑞鼎有限公司', 298338397, '邱正妤', 930016530, 'test31@gmail.com', '嘉義縣太保市高鐵西路171號', '2020-05-22 16:20:00', '2020-05-22 16:20:00'),
('F032', '慶廣如有限公司', 298338398, '何佳志', 930016531, 'test32@gmail.com', '台北市大安區信義路四段149-3號', '2020-05-23 16:20:00', '2020-05-23 16:20:00'),
('F033', '恒泰通有限公司', 298338399, '郭函昕', 930016532, 'test33@gmail.com', '彰化縣彰化市崙平南路127號', '2020-05-24 16:20:00', '2020-05-24 16:20:00'),
('F034', '弘瑞協有限公司', 298338400, '楊世昌', 930016533, 'test34@gmail.com', '台北市大安區信義路四段149-1號', '2020-05-25 16:20:00', '2020-05-25 16:20:00'),
('F035', '盈鼎旺有限公司', 298338401, '翁承翰', 930016534, 'test35@gmail.com', '桃園市平鎮區太平西路99巷20號', '2020-05-26 16:20:00', '2020-05-26 16:20:00'),
('F036', '富光宏有限公司', 298338402, '吳威忠', 930016535, 'test36@gmail.com', '台北市大安區信義路四段149-16號', '2020-05-27 16:20:00', '2020-05-27 16:20:00'),
('F037', '宏春仁有限公司', 298338403, '朱芸辛', 930016536, 'test37@gmail.com', '嘉義縣太保市高鐵西路172號', '2020-05-28 16:20:00', '2020-05-28 16:20:00'),
('F038', '成厚亨有限公司', 298338404, '程勝樺', 930016537, 'test38@gmail.com', '屏東縣長治鄉德和路79號', '2020-05-29 16:20:00', '2020-05-29 16:20:00'),
('F039', '謙利佳有限公司', 298338405, '柯泓竹', 930016538, 'test39@gmail.com', '嘉義縣太保市高鐵西路169號', '2020-05-30 16:20:00', '2020-05-30 16:20:00'),
('F040', '義信佳有限公司', 298338406, '徐逸蘋', 930016539, 'test40@gmail.com', '台北市大安區信義路四段149-15號', '2020-05-31 16:20:00', '2020-05-31 16:20:00'),
('F041', '貴順偉有限公司', 298338407, '陳怡盛', 930016540, 'test41@gmail.com', '桃園市平鎮區太平西路99巷16號', '2020-06-01 16:20:00', '2020-06-01 16:20:00'),
('F042', '通聚有限公司', 298338408, '蘇祖玟', 930016541, 'test42@gmail.com', '台北市大安區信義路四段149-14號', '2020-06-02 16:20:00', '2020-06-02 16:20:00'),
('F043', '泰美有限公司', 298338409, '陳宗憲', 930016542, 'test43@gmail.com', '台北市大安區信義路四段149-8號', '2020-06-03 16:20:00', '2020-06-03 16:20:00'),
('F044', '生潤有限公司', 298338410, '林美惠', 930016543, 'test44@gmail.com', '桃園市平鎮區太平西路99巷21號', '2020-06-04 16:20:00', '2020-06-04 16:20:00'),
('F045', '亨凱有限公司', 298338411, '李孟涵', 930016544, 'test45@gmail.com', '屏東縣長治鄉德和路78號', '2020-06-05 16:20:00', '2020-06-05 16:20:00'),
('F046', '協進有限公司', 298338412, '胡宜芳', 930016545, 'test46@gmail.com', '彰化縣彰化市崙平南路131號', '2020-06-06 16:20:00', '2020-06-06 16:20:00'),
('F047', '乾欣有限公司', 298338413, '戴舜宜', 930016546, 'test47@gmail.com', '台北市大安區信義路四段149-9號', '2020-06-07 16:20:00', '2020-06-07 16:20:00');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `company`
--
ALTER TABLE `company`
  ADD PRIMARY KEY (`companyId`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
